#  How do you load a CSV file into a Pandas DataFrame?

In [3]:
import pandas as pd

df = pd.read_csv('E:\POWERBI PROJECT\project 1\global_superstore_2016')
print(df.to_string())

FileNotFoundError: [Errno 2] No such file or directory: 'E:\\POWERBI PROJECT\\project 1\\global_superstore_2016'

# Q2. How do you check the data type of a column in a Pandas DataFrame?

In [4]:
# importing pandas package
import pandas as pd

# create a Pandas DataFrame
df = pd.DataFrame({'Col1':[4.1, 23.43], 'Col2':['a', 'w'], 'Col3':[1, 8]})

print("DataFrame:")
print(df)

# apply the dtype attribute
result = df.dtypes

print("Output:")
print(result)

DataFrame:
    Col1 Col2  Col3
0   4.10    a     1
1  23.43    w     8
Output:
Col1    float64
Col2     object
Col3      int64
dtype: object

# Q3. How do you select rows from a Pandas DataFrame based on a condition?

# Q4. How do you rename columns in a Pandas DataFrame?

In [7]:
import pandas as pd
   
rankings = {'test': ['India', 'South Africa', 'England',
                            'New Zealand', 'Australia'],
              'odi': ['England', 'India', 'New Zealand',
                            'South Africa', 'Pakistan'],
               't20': ['Pakistan', 'India', 'Australia',
                              'England', 'New Zealand']}
rankings_pd = pd.DataFrame(rankings)
   
# Before renaming the columns
print(rankings_pd.columns)
   
rankings_pd.rename(columns = {'test':'TEST', 'odi':'ODI',
                              't20':'T20'}, inplace = True)
   
# After renaming the columns
print(rankings_pd.columns)
rankings_pd

Index(['test', 'odi', 't20'], dtype='object')
Index(['TEST', 'ODI', 'T20'], dtype='object')

           TEST           ODI          T20
0         India       England     Pakistan
1  South Africa         India        India
2       England   New Zealand    Australia
3   New Zealand  South Africa      England
4     Australia      Pakistan  New Zealand

# Q5. How do you drop columns in a Pandas DataFrame?

In [6]:
del rankings_pd['ODI']
rankings_pd

           TEST          T20
0         India     Pakistan
1  South Africa        India
2       England    Australia
3   New Zealand      England
4     Australia  New Zealand

# Q6. How do you find the unique values in a column of a Pandas DataFrame?

In [12]:
import pandas as pd

# create a DataFrame
dataFrame = pd.DataFrame(
   {
      "Car": ['BMW', 'Audi', 'BMW', 'Lexus', 'Tesla', 'Lexus', 'Mustang'],"Place": ['Delhi','Bangalore','Hyderabad','Chandigarh','Pune', 'Mumbai', 'Jaipur'],"Units": [100, 150, 50, 110, 90, 120, 80]
   }
)

print("DataFrame:",dataFrame)

# get unique values from a column
print("Unique values from a column:",dataFrame['Car'].unique())
print("Count unique values from a column:",dataFrame['Car'].nunique())

DataFrame:        Car       Place  Units
0      BMW       Delhi    100
1     Audi   Bangalore    150
2      BMW   Hyderabad     50
3    Lexus  Chandigarh    110
4    Tesla        Pune     90
5    Lexus      Mumbai    120
6  Mustang      Jaipur     80
Unique values from a column: ['BMW' 'Audi' 'Lexus' 'Tesla' 'Mustang']
Count unique values from a column: 5

# Q7. How do you find the number of missing values in each column of a Pandas DataFrame?

In [4]:
import pandas as pd
import numpy as np

data = {'first_set': [1,2,3,4,5,np.nan,6,7,np.nan,np.nan],
        'second_set': ['a','b',np.nan,np.nan,'c','d','e',np.nan,np.nan,'f'],
        'third_set':['aa',np.nan,'bb','cc',np.nan,np.nan,'dd',np.nan,np.nan,'ee']
        }

df = pd.DataFrame(data,columns=['first_set','second_set','third_set'])

print (df)

   first_set second_set third_set
0        1.0          a        aa
1        2.0          b       NaN
2        3.0        NaN        bb
3        4.0        NaN        cc
4        5.0          c       NaN
5        NaN          d       NaN
6        6.0          e        dd
7        7.0        NaN       NaN
8        NaN        NaN       NaN
9        NaN          f        ee

In [6]:
df['first_set'].isna().sum()

3

# Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

In [14]:
import pandas 
df = pandas.DataFrame({'A' :[0, 3, None, 10, 3, None],
'B' : [None, None, 7.13, 13.82, 7, 7],
'C' : [None, "Pandas", None, "Pandas", "Python", "JavaScript"]})
print(df)

      A      B           C
0   0.0    NaN        None
1   3.0    NaN      Pandas
2   NaN   7.13        None
3  10.0  13.82      Pandas
4   3.0   7.00      Python
5   NaN   7.00  JavaScript

In [16]:
df.fillna("pandas", inplace = True)
df

        A       B           C
0     0.0  pandas      pandas
1     3.0  pandas      Pandas
2  pandas    7.13      pandas
3    10.0   13.82      Pandas
4     3.0     7.0      Python
5  pandas     7.0  JavaScript

# Q9. How do you concatenate two Pandas DataFrames?

In [18]:
import pandas as pd
 
dataframe1 = pd.DataFrame({'columnA': [20, 30, 40],
                           'columnB': [200, 300, 400]})
 
dataframe2 = pd.DataFrame({'columnA': [50, 20, 60],
                           'columnB': [500, 200, 600]})
 
new_dataframe = pd.concat([dataframe1, dataframe2]).drop_duplicates()
 
new_dataframe

   columnA  columnB
0       20      200
1       30      300
2       40      400
0       50      500
2       60      600

# Q10. How do you merge two Pandas DataFrames on a specific column?

In [19]:
import pandas as pd
  
# creating a dataframe
df1 = pd.DataFrame({'Name':['Raju', 'Rani', 'Geeta', 'Sita', 'Sohit'],
                    'Marks':[80, 90, 75, 88, 59]})
  
# creating another dataframe with different data
df2 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],
                    'Grade':['A', 'A', 'B', 'A'],
                    'Rank':[3, 1, 4, 2 ],
                    'Gender':['Male', 'Female', 'Female', 'Female']})
# display df1
display(df1)

    Name  Marks
0   Raju     80
1   Rani     90
2  Geeta     75
3   Sita     88
4  Sohit     59

In [20]:
display(df2)

    Name Grade  Rank  Gender
0   Raju     A     3    Male
1  Divya     A     1  Female
2  Geeta     B     4  Female
3   Sita     A     2  Female

In [21]:
df1.merge(df2[['Name', 'Grade', 'Rank']])

    Name  Marks Grade  Rank
0   Raju     80     A     3
1  Geeta     75     B     4
2   Sita     88     A     2

# Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?

In [22]:
import pandas as pd

In [23]:
data = {"Team": ["Red Sox", "Red Sox", "Red Sox", "Red Sox", "Red Sox", "Red Sox", "Yankees", "Yankees", "Yankees", "Yankees", "Yankees", "Yankees"],
		"Pos": ["Pitcher", "Pitcher", "Pitcher", "Not Pitcher", "Not Pitcher", "Not Pitcher", "Pitcher", "Pitcher", "Pitcher", "Not Pitcher", "Not Pitcher", "Not Pitcher"],
		"Age": [24, 28, 40, 22, 29, 33, 31, 26, 21, 36, 25, 31]}
df = pd.DataFrame(data)
print(df)

       Team          Pos  Age
0   Red Sox      Pitcher   24
1   Red Sox      Pitcher   28
2   Red Sox      Pitcher   40
3   Red Sox  Not Pitcher   22
4   Red Sox  Not Pitcher   29
5   Red Sox  Not Pitcher   33
6   Yankees      Pitcher   31
7   Yankees      Pitcher   26
8   Yankees      Pitcher   21
9   Yankees  Not Pitcher   36
10  Yankees  Not Pitcher   25
11  Yankees  Not Pitcher   31

In [25]:

grouped_single = df.groupby('Team').agg({'Age': ['mean', 'min', 'max']})

print(grouped_single)

               Age
              mean min max
Team
Red Sox  29.333333  22  40
Yankees  28.333333  21  36

# Q12. How do you pivot a Pandas DataFrame?

In [7]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [8]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

# Q13. How do you change the data type of a column in a Pandas DataFrame?

In [9]:
import pandas as pd
 
# sample dataframe
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '1.0', '1.3', 2, 5]})
 
# converting all columns to string type
df = df.astype(str)
print(df.dtypes)

A    object
B    object
C    object
dtype: object

# Q14. How do you sort a Pandas DataFrame by a specific column?

In [29]:
df.sort_values(by=['Age'], ascending=True)

       Team          Pos  Age
8   Yankees      Pitcher   21
3   Red Sox  Not Pitcher   22
0   Red Sox      Pitcher   24
10  Yankees  Not Pitcher   25
7   Yankees      Pitcher   26
1   Red Sox      Pitcher   28
4   Red Sox  Not Pitcher   29
6   Yankees      Pitcher   31
11  Yankees  Not Pitcher   31
5   Red Sox  Not Pitcher   33
9   Yankees  Not Pitcher   36
2   Red Sox      Pitcher   40

# Q15. How do you create a copy of a Pandas DataFrame?

In [11]:
df = pd.DataFrame({"A":[12, 4, 5, 44, 1],
                   "B":[5, 2, 54, 3, 2], 
                   "C":[20, 16, 7, 3, 8],
                   "D":[14, 3, 17, 2, 6]})

df
res = df.copy(deep=True)
print(res)

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

# Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?

In [38]:

dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                           
                          'Age': [30, 35, 37, 33, 34, 30],
                           
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                           
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})
dataFrame

display(dataFrame.loc[(dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')),
                    ['Name','JOB']])

        Name       JOB
0   RACHEL    DESIGNER

# Q17. How do you calculate the mean of a column in a Pandas DataFrame?

In [39]:
import pandas as pd
  
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, 44, 1],
                   "B":[5, 2, 54, 3, 2], 
                   "C":[20, 16, 7, 3, 8],
                   "D":[14, 3, 17, 2, 6]})

df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [40]:
df.mean(axis = 0)

A    13.2
B    13.2
C    10.8
D     8.4
dtype: float64

# Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

# Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?

In [15]:
import pandas as pd
 
data = pd.DataFrame({
    "column1": [12, 23, 45, 67],
    "column2": [67, 54, 32, 1],
    "column3": [34, 23, 56, 23]
}
)
print(data)
 

print(data['column1'].corr(data['column2']))

print(data['column2'].corr(data['column3']))
 

print(data['column1'].corr(data['column3']))

   column1  column2  column3
0       12       67       34
1       23       54       23
2       45       32       56
3       67        1       23
-0.9970476685163736
0.07346999975265099
0.0

# Q20. How do you select specific columns in a DataFrame using their labels?

# Q21. How do you select specific rows in a DataFrame using their indexes?

In [34]:
# import pandas
import pandas as pd
 
# List of Tuples
employees = [('Stuti', 28, 'Varanasi', 20000),
             ('Saumya', 32, 'Delhi', 25000),
             ('Aaditya', 25, 'Mumbai', 40000),
             ('Saumya', 32, 'Delhi', 35000),
             ('Saumya', 32, 'Delhi', 30000),
             ('Saumya', 32, 'Mumbai', 20000),
             ('Aaditya', 40, 'Dehradun', 24000),
             ('Seema', 32, 'Delhi', 70000)
             ]
 
# Create a DataFrame object from list
df = pd.DataFrame(employees,
                  columns=['Name', 'Age',
                           'City', 'Salary'])
 
# Using the operator []
# to select a column
result = df["City"]
 
# Show the dataframe
result

0    Varanasi
1       Delhi
2      Mumbai
3       Delhi
4       Delhi
5      Mumbai
6    Dehradun
7       Delhi
Name: City, dtype: object

# Q22. How do you sort a DataFrame by a specific column?

In [13]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
df
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

# Q23. How do you create a new column in a DataFrame based on the values of another column?

In [33]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})

df['Discounted_Price'] = df['Cost'] - (0.1 * df['Cost'])

print(df)

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

# Q24. How do you remove duplicates from a DataFrame?

In [30]:

  
data = {
    "A": ["TeamA", "TeamB", "TeamB", "TeamC", "TeamA"],
    "B": [50, 40, 40, 30, 50],
    "C": [True, False, False, False, True]
}
  
df = pd.DataFrame(data)
  
display(df.drop_duplicates())

       A   B      C
0  TeamA  50   True
1  TeamB  40  False
3  TeamC  30  False

# Q25. What is the difference between .loc and .iloc in Pandas?

loc in Pandas:
Label-based data selector
Indices should be sorted in order, or loc[ ] will only select the mentioned indices when slicing
Indices should be numerical, else slicing cannot be done
The end index is included during slicing
Accepts bool series or list in conditions

iloc in Pandas:
Index-based data selector
Indices need not be sorted in order when slicing
Indices can be numerical or categorical
The end index is excluded during slicing
Only accepts bool list in conditions